КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗЗ_Титул2/КонтурЛогистика_ЗЗ_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЗЗ_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_Зак</name>
    <comment>Выдается ГИС ЭПД Уникальный идентификатор документа заказа (заявки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Составитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации грузоотправителя</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимЭкСубСост</name>
    <comment>Наименование экономического субъекта, составляющего файл обмена информации перевозчика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфГО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПГО</name>
    <comment>Электронная подпись файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>Признак отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>Причина отказа в приеме заказа (заявки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвЛицОргПрвз</name>
    <comment>Сведение о лице, ответственном за организацию перевозки со стороны перевозчика (СвЛицОргПрвз)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЛицПрв</name>
    <comment>Сведения о лице, уполномоченном перевозчиком на заполнение и подписание заказа (заявки)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <comment>Транспортное средство</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СтТовБезНДС</name>
    <comment>Стоимость перевозки без налога – всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалСт</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтТовУчНал</name>
    <comment>Стоимость перевозки с налогом – всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расчет</name>
    <comment>Порядок (механизм) расчета (исчислений) платы</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверИдДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверДопСведДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверСоставитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверСоставитель2</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Водители</name>
    <attributes>
      <name>СвВодит</name>
      <comment>Сведения о водителе</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прицепы</name>
    <attributes>
      <name>Прицеп</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпецУсловияДвижения</name>
    <attributes>
      <name>НомСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСР</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршТекст</name>
      <comment>Установленный маршрут движения тяжеловесного и (или) крупногабаритного транспортного средства или транспортного средства, перевозящего опасный груз</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршМашЧит</name>
      <comment>Маршрут, машиночитаемый формат</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаимОИВ</name>
      <comment>Краткое наименование органа исполнительной власти (специализированной уполномоченной организации), выдавшего документ</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗЗ_Титул2/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Титул1");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаЗЗ(Данные.Титул1, Представление, СтандартнаяОбработка, "2");
	
КонецПроцедуры

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ПричОтк");
	МассивОбязательных.Добавить("СвЛицОргПрвз");
	МассивОбязательных.Добавить("ТранспортноеСредство");
	МассивОбязательных.Добавить("Составитель");
	МассивОбязательных.Добавить("ОснДовОргСост");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ВодителиМассивСтруктур",
		"Сведения о водителях",
		"Заполняется, если заявка принята перевозчиком",
		"МассивСтруктур (см. ТЧ Водители)",
		2));
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ПрицепыМассивСтруктур",
		"Сведения о прицепах",
		"",
		"МассивСтруктур (см. ТЧ Прицепы)",
		2));
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"СпецУсловияДвиженияМассивСтруктур",
		"Сведения о специальных условиях движения",
		"Заполняется, если заявка принята перевозчиком",
		"МассивСтруктур (см. ТЧ СпецУсловияДвижения)",
		2));
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеПолучателиФайлаМассивСтруктур",
		"Дополнительные получатели файла",
		"Указываются дополнительные получатели файла",
		"МассивСтруктур(см. таблицу ДополнительныеПолучателиФайла)",
		2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_Зак");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("Титул1");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфПрв");
	МассивКлючевых.Добавить("ВрИнфПрв");
	
	МассивКлючевых.Добавить("ИдФайлИнфГО");
	МассивКлючевых.Добавить("ДатФайлИнфГО");
	МассивКлючевых.Добавить("ВрФайлИнфГО");
	МассивКлючевых.Добавить("ЭПГО");
	
	Возврат МассивКлючевых;
	
КонецФункции

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.Титул1, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2, ТаблицаОшибок, ДокументОбъектИлиСсылка.Титул1.Перевозчик);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		// TODO - доделать валидатор
		//
		//ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		//ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда 
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭПГО) Тогда
		
		ТекстОшибки = "Не получена подпись грузоотправителя. Попробуйте выполнить обмен и перезаполнить титул";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"ЭПГО", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Титул1)  Тогда
		
		ТекстОшибки = "Титул не привязан к Титулу 1 Заказа (заявки)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ЗЗ_Титул1", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
			
			Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
				
				ОбязательныйРевизитСиноним = СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
				
		КонецЦикла;
		
		// ОрганизацияСоставитель 
		Если ЗначениеЗаполнено(Объект.Составитель) И Объект.Составитель <> Объект.Титул1.Перевозчик Тогда 
			
			Если НЕ Объект.Составитель = Объект.Титул1.Перевозчик Тогда
				
				Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост) Тогда
				
					ТекстОшибки = "Укажите договор-основание полномочий составителя файла обмена";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"Объект.ОснДовОргСост", КатегорияОшибка, ТекстОшибки, "Указать");
					
				Иначе 
					
					Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост.Организация)
						И Не ЗначениеЗаполнено(Объект.ОснДовОргСост.ОрганизацияИНН) Тогда
						
						ТекстОшибки = "Укажите организацию или ИНН, к которой относится договор составителя заказа (заявки)";
						КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
							"Объект.ОснДовОргСост.ОрганизацияИНН", КатегорияОшибка, ТекстОшибки, "Указать");
						
					КонецЕсли;	
					
					Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост.Контрагент)
						И Не ЗначениеЗаполнено(Объект.ОснДовОргСост.КонтрагентИНН) Тогда
						
						ТекстОшибки = "Укажите контрагента или ИНН, с которым у организации заключен договор составителя заказа (заявки)";
						КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
							"Объект.ОснДовОргСост.КонтрагентИНН", КатегорияОшибка, ТекстОшибки, "Указать");
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Объект.ЕстьОтказВПодписи Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
				
				ТекстОшибки = "Не указана причина отказа в приеме";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ПричинаОтказаВПриеме", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		Иначе
			
			// УИД
			Если Не ЗначениеЗаполнено(Объект.Титул1.УИД_Зак) Тогда
				ТекстОшибки = "Не загружен УИД заказ (заявка) в Титул1. Выполните обмен.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
					"УИД_Зак", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
			КонецЕсли;
			
			// СвЛицОргПрвз
			Если Не ЗначениеЗаполнено(Объект.СвЛицОргПрвз) Тогда
					
				ТекстОшибки = "Укажите лицо, ответственное за организацию перевозки";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"СвЛицОргПрвз", КатегорияОшибка, ТекстОшибки, "Указать");
				
			Иначе
				
				Если Не ЗначениеЗаполнено(Объект.СвЛицОргПрвз.ТелефонОсновной) Тогда
					ТекстОшибки = "Укажите телефон лица, ответственного за организацию перевозки";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"СвЛицОргПрвз.ТелефонОсновной", КатегорияОшибка, ТекстОшибки, "Указать");
				КонецЕсли;
				
			КонецЕсли;
			
			// СвВодит
			ПроверитьВодителей(Объект, ТаблицаОшибок);
			
			// СвЛицПрв			
			Если ЗначениеЗаполнено(Объект.СвЛицПрв) Тогда 
				ПроверитьРеквизитыДоверенности(Объект, ТаблицаОшибок);					
			КонецЕсли;	
			
			// СвТС
			ПроверитьТранспортноеСредство(Объект, ТаблицаОшибок);
			ПроверитьПрицеп(Объект, ТаблицаОшибок);
			ПроверитьСпецУсловия(Объект, ТаблицаОшибок);
			
			// РазмПлатРасчет
			Если Не ЗначениеЗаполнено(Объект.Расчет) И Не ЗначениеЗаполнено(Объект.СтТовБезНДС) И Не ЗначениеЗаполнено(Объект.НалСт) Тогда
				
				ТекстОшибки = "Укажите Порядок расчета ИЛИ Стоимость перевозки без НДС и Налоговую ставку";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"Расчет", КатегорияОшибка, ТекстОшибки, "Указать");
					
			ИначеЕсли ЗначениеЗаполнено(Объект.СтТовБезНДС) И Не ЗначениеЗаполнено(Объект.НалСт) Тогда 		
				
				ТекстОшибки = "Укажите Налоговую ставку";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"НалСт", КатегорияОшибка, ТекстОшибки, "Указать");
				
			ИначеЕсли ЗначениеЗаполнено(Объект.НалСт) И Не ЗначениеЗаполнено(Объект.СтТовБезНДС) Тогда 		
				
				ТекстОшибки = "Укажите Стоимость перевозки без НДС";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"СтТовБезНДС", КатегорияОшибка, ТекстОшибки, "Указать");	
				
			КонецЕсли;
			
			// Провдение документа основания
			КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
			
		КонецЕсли;
		
	КонецЕсли;
		
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьВодителей(Знач Объект, ТаблицаОшибок)

	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	ИмяТЧ = "Водители";
	
	Если Объект.Водители.Количество() = 0 Тогда 
			
		ТекстОшибки = "Укажите водителя";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"Водитель", КатегорияОшибка, ТекстОшибки, "Указать");
			
	Иначе

		Для Каждого СтрокаВодитель Из Объект.Водители Цикл 
			
			НомерСтроки 	= СтрокаВодитель.НомерСтроки;
			Водитель 		= СтрокаВодитель.СвВодит;
			
			Если ЗначениеЗаполнено(Водитель) Тогда
					
				Если Не ЗначениеЗаполнено(Водитель.ТелефонОсновной) Тогда
					ТекстОшибки = "Укажите телефон водителя";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"СвВодит.ТелефонОсновной", КатегорияОшибка, ТекстОшибки, "Указать");
				КонецЕсли;
								
				Если Не ЗначениеЗаполнено(Водитель.ВУДатаВыдачи) Тогда			
					ТекстОшибки = "Укажите у водителя дату выдачи ВУ";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"СвВодит.ВУДатаВыдачи", КатегорияОшибка, ТекстОшибки, "Указать");
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Водитель.ВУНомер) Тогда
					ТекстОшибки = "Укажите у водителя номер ВУ";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"СвВодит.ВУНомер", КатегорияОшибка, ТекстОшибки, "Указать");
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Водитель.ВУСерия) Тогда				
					ТекстОшибки = "Укажите у водителя серию ВУ";				
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"СвВодит.ВУСерия", КатегорияОшибка, ТекстОшибки, "Указать");				
				КонецЕсли;	
									
				Если Не ЗначениеЗаполнено(Водитель.ИНН) Тогда 
					ТекстОшибки = "Укажите у водителя серию ВУ";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"СвВодит.ИНН", КатегорияОшибка, "Укажите ИНН водителя", "Указать");
				Иначе	
					ТекстОшибки = Справочники.КонтурЛогистика_Сотрудники.ТекстОшибкиПроверкиИНН(Водитель.ИНН);
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
					    КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
							"СвВодит.ИНН", КатегорияОшибка, "Укажите верный ИНН водителя. " + ТекстОшибки, "Указать");
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Объект.Титул1.Перевозчик)
					И КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступенСервисФизЛиц(Объект.Титул1.Перевозчик) Тогда				
					КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителяВСервисе(Объект.Титул1.Перевозчик, Водитель, "СвВодит", ТаблицаОшибок, ИмяТЧ, НомерСтроки);				
				КонецЕсли;
				
			Иначе	
				
				ТекстОшибки = "Укажите водителя";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"СвВодит", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
							
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьРеквизитыДоверенности(Знач Объект, ТаблицаОшибок)

	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	Если Не ЗначениеЗаполнено(Объект.РеквДоверИдДок) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверНаименование) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверНомер)
		И Не ЗначениеЗаполнено(Объект.РеквДоверДата) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель2) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверДопСведДок) Тогда 
		
		ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей доверенности.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"РеквДоверНаименование", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.РеквДоверИдДок) 
		И (ЗначениеЗаполнено(Объект.РеквДоверНаименование)
		Или ЗначениеЗаполнено(Объект.РеквДоверНомер) 
		Или ЗначениеЗаполнено(Объект.РеквДоверДата)
		Или ЗначениеЗаполнено(Объект.РеквДоверСоставитель)
		Или ЗначениеЗаполнено(Объект.РеквДоверСоставитель2) 
		Или ЗначениеЗаполнено(Объект.РеквДоверДопСведДок)) Тогда	
			
		Если Не ЗначениеЗаполнено(Объект.РеквДоверНаименование) Тогда 
			
			ТекстОшибки = "Укажите наименование доверенности.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"РеквДоверНаименование", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.РеквДоверДата) Тогда 
			
			ТекстОшибки = "Укажите дату доверенности.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"РеквДоверДата", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель) И Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель2) Тогда 
			
			ТекстОшибки = "Укажите составителей доверенности.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"РеквДоверСоставитель", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьТранспортноеСредство(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка");
	КатегорияПредупреждение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение");
	
	ТранспортноеСредство = Объект.ТранспортноеСредство;
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.РегНомер) Тогда
			
			ТекстОшибки = "Укажите рег. номер транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.РегНомер", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ВидВладения) Тогда
			
			ТекстОшибки = "Укажите вид владения транспортным средством";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
			
		Иначе
			
			// TODO валидация основания владения 
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ГрузоподъемностьТонн) Тогда
			
			Если Не ЗначениеЗаполнено(Объект.Прицепы) Тогда
				ТекстОшибки = "Укажите прицеп или грузоподъемность транспортного средства";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"Прицеп", КатегорияОшибка, ТекстОшибки, "Указать");
			Иначе
				ТекстОшибки = "Не указана грузоподъемность транспортного средства (тягач?)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ТранспортноеСредство.ГрузоподъемностьТонн", КатегорияПредупреждение, ТекстОшибки, "Проверить");
			КонецЕсли;
		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ВместимостьКубМ) Тогда
			
			Если Не ЗначениеЗаполнено(Объект.Прицепы) Тогда
				ТекстОшибки = "Укажите прицеп или вместимость транспортного средства";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"Прицеп", КатегорияОшибка, ТекстОшибки, "Указать");
			Иначе
				ТекстОшибки = "Не указана вместимость транспортного средства (тягач?)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ТранспортноеСредство.ВместимостьКубМ", КатегорияПредупреждение, ТекстОшибки, "Проверить");
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ТипТС) Тогда
			
			ТекстОшибки = "Укажите тип транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ТипТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.МаркаТС) Тогда
			
			ТекстОшибки = "Укажите марку транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.МаркаТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		РезультатПроверкиТС = Справочники.КонтурЛогистика_ТранспортныеСредства.РезультатПроверкиАрендатораДоговора(ТранспортноеСредство, Ложь);
		Если РезультатПроверкиТС.ЕстьОшибки Тогда
			Для Каждого Ошибка Из РезультатПроверкиТС.ОшибкиПолей Цикл
				ИмяПоля = "ТранспортноеСредство." + Ошибка.ИмяПоля;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					ИмяПоля, КатегорияОшибка, Ошибка.ТекстОшибки, "Указать");
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = "Укажите Транспортное средство";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ТранспортноеСредство", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПроверитьПрицеп(Знач Объект, ТаблицаОшибок)

	Если ЗначениеЗаполнено(Объект.Прицепы) Тогда 
			
		КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
		ИмяТЧ = "Прицепы";

		Для Каждого СтрокаПрицеп Из Объект.Прицепы Цикл
			
			НомерСтроки = СтрокаПрицеп.НомерСтроки;
			Прицеп 		= СтрокаПрицеп.Прицеп;
			
			Если ЗначениеЗаполнено(Прицеп) Тогда
				
				Если Не ЗначениеЗаполнено(Прицеп.ВидВладения) Тогда
					
					ТекстОшибки = "Укажите вид владения прицепом";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"Прицеп.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Прицеп.ГрузоподъемностьТонн) Тогда
					
					ТекстОшибки = "Укажите грузоподъемность прицепа";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"Прицеп.ГрузоподъемностьТонн", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Прицеп.ТипТС) Тогда
					
					ТекстОшибки = "Укажите тип прицепа";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"Прицеп.ТипТС", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Прицеп.МаркаТС) Тогда
					
					ТекстОшибки = "Укажите марку прицепа";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"Прицеп.МаркаТС", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Прицеп.ВместимостьКубМ) Тогда
					
					ТекстОшибки = "Укажите вместимость прицепа";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
						"Прицеп.ВместимостьКубМ", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
			Иначе
				
				ТекстОшибки = "Укажите прицеп";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"Прицеп", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПроверитьСпецУсловия(Знач Объект, ТаблицаОшибок) 
	
	Если ЗначениеЗаполнено(Объект.СпецУсловияДвижения) Тогда 
		
		КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
		ИмяТЧ = "СпецУсловияДвижения";
		
		Для Каждого СтрокаУслДвижения Из Объект.СпецУсловияДвижения Цикл
			
			НомерСтроки = СтрокаУслДвижения.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаУслДвижения.ИдСР) 
				И Не ЗначениеЗаполнено(СтрокаУслДвижения.НомСР) 
				И Не ЗначениеЗаполнено(СтрокаУслДвижения.ДатаСР) 
				И Не ЗначениеЗаполнено(СтрокаУслДвижения.СрокСР)
				И Не ЗначениеЗаполнено(СтрокаУслДвижения.ВидСР)
				И Не ЗначениеЗаполнено(СтрокаУслДвижения.НаимОИВ) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Номер, Дату, Срок, Вид спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"НомСР", КатегорияОшибка, ТекстОшибки, "Указать");
								
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(СтрокаУслДвижения.ИдСР) 
				И (ЗначениеЗаполнено(СтрокаУслДвижения.НомСР) 
				Или ЗначениеЗаполнено(СтрокаУслДвижения.ДатаСР)
				Или ЗначениеЗаполнено(СтрокаУслДвижения.СрокСР)
				Или ЗначениеЗаполнено(СтрокаУслДвижения.ВидСР)
				Или ЗначениеЗаполнено(СтрокаУслДвижения.НаимОИВ)) Тогда	
					
				Если Не ЗначениеЗаполнено(СтрокаУслДвижения.НомСР) Тогда 
					
					ТекстОшибки = "Укажите Номер специального разрешения.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НомСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаУслДвижения.ДатаСР) Тогда 
					
					ТекстОшибки = "Укажите Дату специального разрешения.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ДатаСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаУслДвижения.СрокСР) Тогда 
					
					ТекстОшибки = "Укажите Срок специального разрешения.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"СрокСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаУслДвижения.ВидСР) Тогда 
					
					ТекстОшибки = "Укажите Вид специального разрешения.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ВидСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаУслДвижения.НаимОИВ) Тогда 
					
					ТекстОшибки = "Укажите Наименование органа, выдавшего специальное разрешение.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НаимОИВ", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
					
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры	

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ЗЗ_Титул2.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

#КонецЕсли
